Alexanderofhust/winterproject/MIMXRT1021_Project/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* WAKEUP (number 52), USER_BUTTON */
/* Routed pin properties */
#define BOARD_INITPINS_u_tem0_PERIPHERAL                                   GPIO5   /*!< Peripheral name */
#define BOARD_INITPINS_u_tem0_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_u_tem0_CHANNEL                                         0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_u_tem0_GPIO                                         GPIO5   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_u_tem0_GPIO_PIN                                        0U   /*!< GPIO pin number */
#define BOARD_INITPINS_u_tem0_GPIO_PIN_MASK                           (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_u_tem0_PORT                                         GPIO5   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_u_tem0_PIN                                             0U   /*!< PORT pin number */
#define BOARD_INITPINS_u_tem0_PIN_MASK                                (1U << 0U)   /*!< PORT pin mask */

/* PMIC_ON_REQ (number 53), PMIC_ON_REQ */
/* Routed pin properties */
#define BOARD_INITPINS_u_tem1_PERIPHERAL                                   GPIO5   /*!< Peripheral name */
#define BOARD_INITPINS_u_tem1_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_u_tem1_CHANNEL                                         1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_u_tem1_GPIO                                         GPIO5   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_u_tem1_GPIO_PIN                                        1U   /*!< GPIO pin number */
#define BOARD_INITPINS_u_tem1_GPIO_PIN_MASK                           (1U << 1U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_u_tem1_PORT                                         GPIO5   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_u_tem1_PIN                                             1U   /*!< PORT pin number */
#define BOARD_INITPINS_u_tem1_PIN_MASK                                (1U << 1U)   /*!< PORT pin mask */

/* GPIO_EMC_31 (number 125), SEMC_DM1/U14[39] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM1_PERIPHERAL                                 GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM1_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM1_CHANNEL                                      31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_DM1_GPIO                                       GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_DM1_GPIO_PIN                                     31U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_DM1_GPIO_PIN_MASK                        (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SEMC_DM1_PORT                                       GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SEMC_DM1_PIN                                          31U   /*!< PORT pin number */
#define BOARD_INITPINS_SEMC_DM1_PIN_MASK                             (1U << 31U)   /*!< PORT pin mask */

/* GPIO_EMC_32 (number 124), SEMC_D8/U14[42] */
/* Routed pin properties */
#define BOARD_INITPINS_S_CLK_PERIPHERAL                                   LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_CLK_SIGNAL                                          SCK   /*!< Signal name */

/* GPIO_EMC_33 (number 123), SEMC_D9/U14[44] */
/* Routed pin properties */
#define BOARD_INITPINS_S_CS_PERIPHERAL                                    LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_CS_SIGNAL                                          PCS0   /*!< Signal name */

/* GPIO_EMC_34 (number 122), SEMC_D10/U14[45] */
/* Routed pin properties */
#define BOARD_INITPINS_S_MOSI_PERIPHERAL                                  LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_MOSI_SIGNAL                                         SDO   /*!< Signal name */

/* GPIO_EMC_35 (number 121), SEMC_D11/U14[47] */
/* Routed pin properties */
#define BOARD_INITPINS_S_MISO_PERIPHERAL                                  LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_MISO_SIGNAL                                         SDI   /*!< Signal name */

/* GPIO_EMC_36 (number 120), SEMC_D12/U14[48] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D12_PERIPHERAL                                 GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D12_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D12_CHANNEL                                       4U   /*!< Signal channel */

